zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXE/periph2/PERI_SYSMPU.h
/*
** ###################################################################
**     Processors:          MCXE246VLH
**                          MCXE246VLL
**                          MCXE246VLQ
**
**     Version:             rev. 1.0, 2025-02-21
**     Build:               b250610
**
**     Abstract:
**         CMSIS Peripheral Access Layer for SYSMPU
**
**     Copyright 1997-2016 Freescale Semiconductor, Inc.
**     Copyright 2016-2025 NXP
**     SPDX-License-Identifier: BSD-3-Clause
**
**     http:                 www.nxp.com
**     mail:                 support@nxp.com
**
**     Revisions:
**     - rev. 1.0 (2025-02-21)
**         Generated based on Rev1 Draft RM..
**
** ###################################################################
*/

/*!
 * @file PERI_SYSMPU.h
 * @version 1.0
 * @date 2025-02-21
 * @brief CMSIS Peripheral Access Layer for SYSMPU
 *
 * CMSIS Peripheral Access Layer for SYSMPU
 */

#if !defined(PERI_SYSMPU_H_)
#define PERI_SYSMPU_H_                           /**< Symbol preventing repeated inclusion */

#if (defined(CPU_MCXE246VLH) || defined(CPU_MCXE246VLL) || defined(CPU_MCXE246VLQ))
#include "MCXE246_COMMON.h"
#else
  #error "No valid CPU defined!"
#endif

/* ----------------------------------------------------------------------------
   -- Device Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Peripheral_access_layer Device Peripheral Access Layer
 * @{
 */


/*
** Start of section using anonymous unions
*/

#if defined(__ARMCC_VERSION)
  #if (__ARMCC_VERSION >= 6010050)
    #pragma clang diagnostic push
  #else
    #pragma push
    #pragma anon_unions
  #endif
#elif defined(__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma language=extended
#else
  #error Not supported compiler type
#endif

/* ----------------------------------------------------------------------------
   -- SYSMPU Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup SYSMPU_Peripheral_Access_Layer SYSMPU Peripheral Access Layer
 * @{
 */

/** SYSMPU - Size of Registers Arrays */
#define SYSMPU_SP_COUNT                           4u
#define SYSMPU_RGD_COUNT                          8u
#define SYSMPU_RGD_WORD_COUNT                     4u
#define SYSMPU_RGDAAC_COUNT                       8u

/** SYSMPU - Register Layout Typedef */
typedef struct {
  __IO uint32_t CESR;                              /**< Control/Error Status Register, offset: 0x0 */
       uint8_t RESERVED_0[12];
  struct {                                         /* offset: 0x10, array step: 0x8 */
    __I  uint32_t EAR;                               /**< Error Address Register, slave port 0..Error Address Register, slave port 3, array offset: 0x10, array step: 0x8 */
    __I  uint32_t EDR;                               /**< Error Detail Register, slave port 0..Error Detail Register, slave port 3, array offset: 0x14, array step: 0x8 */
  } SP[SYSMPU_SP_COUNT];
       uint8_t RESERVED_1[976];
  __IO uint32_t WORD[SYSMPU_RGD_COUNT][SYSMPU_RGD_WORD_COUNT]; /**< Region Descriptor 0, Word 0..Region Descriptor 7, Word 3, array offset: 0x400, array step: index*0x10, index2*0x4 */
       uint8_t RESERVED_2[896];
  __IO uint32_t RGDAAC[SYSMPU_RGDAAC_COUNT];       /**< Region Descriptor Alternate Access Control 0..Region Descriptor Alternate Access Control 7, array offset: 0x800, array step: 0x4 */
} SYSMPU_Type;

/* ----------------------------------------------------------------------------
   -- SYSMPU Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup SYSMPU_Register_Masks SYSMPU Register Masks
 * @{
 */

/*! @name CESR - Control/Error Status Register */
/*! @{ */

#define SYSMPU_CESR_VLD_MASK                     (0x1U)
#define SYSMPU_CESR_VLD_SHIFT                    (0U)
/*! VLD - Valid
 *  0b0..MPU is disabled. All accesses from all bus masters are allowed.
 *  0b1..MPU is enabled
 */
#define SYSMPU_CESR_VLD(x)                       (((uint32_t)(((uint32_t)(x)) << SYSMPU_CESR_VLD_SHIFT)) & SYSMPU_CESR_VLD_MASK)

#define SYSMPU_CESR_NRGD_MASK                    (0xF00U)
#define SYSMPU_CESR_NRGD_SHIFT                   (8U)
/*! NRGD - Number Of Region Descriptors
 *  0b0000..8 region descriptors
 *  0b0001..12 region descriptors
 *  0b0010..16 region descriptors
 */
#define SYSMPU_CESR_NRGD(x)                      (((uint32_t)(((uint32_t)(x)) << SYSMPU_CESR_NRGD_SHIFT)) & SYSMPU_CESR_NRGD_MASK)

#define SYSMPU_CESR_NSP_MASK                     (0xF000U)
#define SYSMPU_CESR_NSP_SHIFT                    (12U)
/*! NSP - Number Of Slave Ports */
#define SYSMPU_CESR_NSP(x)                       (((uint32_t)(((uint32_t)(x)) << SYSMPU_CESR_NSP_SHIFT)) & SYSMPU_CESR_NSP_MASK)

#define SYSMPU_CESR_HRL_MASK                     (0xF0000U)
#define SYSMPU_CESR_HRL_SHIFT                    (16U)
/*! HRL - Hardware Revision Level */
#define SYSMPU_CESR_HRL(x)                       (((uint32_t)(((uint32_t)(x)) << SYSMPU_CESR_HRL_SHIFT)) & SYSMPU_CESR_HRL_MASK)

#define SYSMPU_CESR_SPERR3_MASK                  (0x10000000U)
#define SYSMPU_CESR_SPERR3_SHIFT                 (28U)
/*! SPERR3 - Slave Port 3 Error
 *  0b0..No error has occurred for slave port 3.
 *  0b1..An error has occurred for slave port 3.
 */
#define SYSMPU_CESR_SPERR3(x)                    (((uint32_t)(((uint32_t)(x)) << SYSMPU_CESR_SPERR3_SHIFT)) & SYSMPU_CESR_SPERR3_MASK)

#define SYSMPU_CESR_SPERR2_MASK                  (0x20000000U)
#define SYSMPU_CESR_SPERR2_SHIFT                 (29U)
/*! SPERR2 - Slave Port 2 Error
 *  0b0..No error has occurred for slave port 2.
 *  0b1..An error has occurred for slave port 2.
 */
#define SYSMPU_CESR_SPERR2(x)                    (((uint32_t)(((uint32_t)(x)) << SYSMPU_CESR_SPERR2_SHIFT)) & SYSMPU_CESR_SPERR2_MASK)

#define SYSMPU_CESR_SPERR1_MASK                  (0x40000000U)
#define SYSMPU_CESR_SPERR1_SHIFT                 (30U)
/*! SPERR1 - Slave Port 1 Error
 *  0b0..No error has occurred for slave port 1.
 *  0b1..An error has occurred for slave port 1.
 */
#define SYSMPU_CESR_SPERR1(x)                    (((uint32_t)(((uint32_t)(x)) << SYSMPU_CESR_SPERR1_SHIFT)) & SYSMPU_CESR_SPERR1_MASK)

#define SYSMPU_CESR_SPERR0_MASK                  (0x80000000U)
#define SYSMPU_CESR_SPERR0_SHIFT                 (31U)
/*! SPERR0 - Slave Port 0 Error
 *  0b0..No error has occurred for slave port 0.
 *  0b1..An error has occurred for slave port 0.
 */
#define SYSMPU_CESR_SPERR0(x)                    (((uint32_t)(((uint32_t)(x)) << SYSMPU_CESR_SPERR0_SHIFT)) & SYSMPU_CESR_SPERR0_MASK)
/*! @} */

/*! @name EAR - Error Address Register, slave port 0..Error Address Register, slave port 3 */
/*! @{ */

